# Задание №1
# Написать программу, которая считывает целое число и выводит значение,
# которое в два раза больше, чем введенное.
value = int(input("Enter here:"))
result_2 = int(value * 2)
print(result_2, type(result_2))
######################################
# Задание №2
# Написать программу,
# которая считывает число с точкой и выводит значение,
# которое в два раза больше, чем введенное.
my_value = float(input("Enter here:"))
my_result_2 = float(my_value * 2)
print(my_result_2, type(my_result_2))
######################################
# Задание №3
# Написать программу, которая считывает строку и выводит удвоенную эту строку
string_1 = str(input("Enter here:"))
strng_result_2 = str(string_1 * 2)
print(strng_result_2, type(strng_result_2))
